app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    if @book.save
---
INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "サヨナラ絶望先生"], ["body", "コメディ"], ["created_at", "2019-12-27 08:38:13.496716"], ["updated_at", "2019-12-27 08:38:13.496716"]]

  def update
    @book = Book.find(params[:id])
    if @book.update(book_params)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "夢物語"], ["updated_at", "2019-12-27 09:13:01.881775"], ["id", 7]]